zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_jh/pic32cm_jh00/pic32cm2532jh00048-pinctrl.h
/*
 * Copyright (c) 2025 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Autogenerated file
 */

#ifndef MICROCHIP_PIC32CM2532JH00048_PINCTRL_H_
#define MICROCHIP_PIC32CM2532JH00048_PINCTRL_H_

#include <dt-bindings/pic32c/pic32cm_jh/common/mchp_pinctrl_pinmux_pic32c.h>

/* pa0_gpio */
#define PA0_GPIO MCHP_PINMUX(a, 0, gpio, gpio)

/* pa0a_eic_extint0 */
#define PA0A_EIC_EXTINT0 MCHP_PINMUX(a, 0, a, periph)

/* pa0a_rstc_extwake0 */
#define PA0A_RSTC_EXTWAKE0 MCHP_PINMUX(a, 0, a, periph)

/* pa0d_sercom1_pad0 */
#define PA0D_SERCOM1_PAD0 MCHP_PINMUX(a, 0, d, periph)

/* pa0e_tcc2_wo0 */
#define PA0E_TCC2_WO0 MCHP_PINMUX(a, 0, e, periph)

/* pa0f_tc7_wo0 */
#define PA0F_TC7_WO0 MCHP_PINMUX(a, 0, f, periph)

/* pa0h_ac_cmp2 */
#define PA0H_AC_CMP2 MCHP_PINMUX(a, 0, h, periph)

/* pa1_gpio */
#define PA1_GPIO MCHP_PINMUX(a, 1, gpio, gpio)

/* pa1a_eic_extint1 */
#define PA1A_EIC_EXTINT1 MCHP_PINMUX(a, 1, a, periph)

/* pa1a_rstc_extwake1 */
#define PA1A_RSTC_EXTWAKE1 MCHP_PINMUX(a, 1, a, periph)

/* pa1d_sercom1_pad1 */
#define PA1D_SERCOM1_PAD1 MCHP_PINMUX(a, 1, d, periph)

/* pa1e_tcc2_wo1 */
#define PA1E_TCC2_WO1 MCHP_PINMUX(a, 1, e, periph)

/* pa1f_tc7_wo1 */
#define PA1F_TC7_WO1 MCHP_PINMUX(a, 1, f, periph)

/* pa1h_ac_cmp3 */
#define PA1H_AC_CMP3 MCHP_PINMUX(a, 1, h, periph)

/* pa2_gpio */
#define PA2_GPIO MCHP_PINMUX(a, 2, gpio, gpio)

/* pa2a_eic_extint2 */
#define PA2A_EIC_EXTINT2 MCHP_PINMUX(a, 2, a, periph)

/* pa2a_rstc_extwake2 */
#define PA2A_RSTC_EXTWAKE2 MCHP_PINMUX(a, 2, a, periph)

/* pa2b_ac_ain4 */
#define PA2B_AC_AIN4 MCHP_PINMUX(a, 2, b, periph)

/* pa2b_adc0_ain0 */
#define PA2B_ADC0_AIN0 MCHP_PINMUX(a, 2, b, periph)

/* pa2b_dac_vout */
#define PA2B_DAC_VOUT MCHP_PINMUX(a, 2, b, periph)

/* pa2b_ptc_y0 */
#define PA2B_PTC_Y0 MCHP_PINMUX(a, 2, b, periph)

/* pa2k_ptc_ds0 */
#define PA2K_PTC_DS0 MCHP_PINMUX(a, 2, k, periph)

/* pa3_gpio */
#define PA3_GPIO MCHP_PINMUX(a, 3, gpio, gpio)

/* pa3a_eic_extint3 */
#define PA3A_EIC_EXTINT3 MCHP_PINMUX(a, 3, a, periph)

/* pa3a_rstc_extwake3 */
#define PA3A_RSTC_EXTWAKE3 MCHP_PINMUX(a, 3, a, periph)

/* pa3b_ac_ain5 */
#define PA3B_AC_AIN5 MCHP_PINMUX(a, 3, b, periph)

/* pa3b_adc0_ain1 */
#define PA3B_ADC0_AIN1 MCHP_PINMUX(a, 3, b, periph)

/* pa3b_adc0_vrefp */
#define PA3B_ADC0_VREFP MCHP_PINMUX(a, 3, b, periph)

/* pa3b_dac_vrefp */
#define PA3B_DAC_VREFP MCHP_PINMUX(a, 3, b, periph)

/* pa3b_ptc_y1 */
#define PA3B_PTC_Y1 MCHP_PINMUX(a, 3, b, periph)

/* pa3k_ptc_ds1 */
#define PA3K_PTC_DS1 MCHP_PINMUX(a, 3, k, periph)

/* pa4_gpio */
#define PA4_GPIO MCHP_PINMUX(a, 4, gpio, gpio)

/* pa4a_eic_extint4 */
#define PA4A_EIC_EXTINT4 MCHP_PINMUX(a, 4, a, periph)

/* pa4a_rstc_extwake4 */
#define PA4A_RSTC_EXTWAKE4 MCHP_PINMUX(a, 4, a, periph)

/* pa4b_ac_ain0 */
#define PA4B_AC_AIN0 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_adc0_ain4 */
#define PA4B_ADC0_AIN4 MCHP_PINMUX(a, 4, b, periph)

/* pa4b_ptc_y2 */
#define PA4B_PTC_Y2 MCHP_PINMUX(a, 4, b, periph)

/* pa4d_sercom0_pad0 */
#define PA4D_SERCOM0_PAD0 MCHP_PINMUX(a, 4, d, periph)

/* pa4e_tcc0_wo0 */
#define PA4E_TCC0_WO0 MCHP_PINMUX(a, 4, e, periph)

/* pa4f_tc5_wo0 */
#define PA4F_TC5_WO0 MCHP_PINMUX(a, 4, f, periph)

/* pa4i_ccl_in0 */
#define PA4I_CCL_IN0 MCHP_PINMUX(a, 4, i, periph)

/* pa4k_ptc_ds2 */
#define PA4K_PTC_DS2 MCHP_PINMUX(a, 4, k, periph)

/* pa5_gpio */
#define PA5_GPIO MCHP_PINMUX(a, 5, gpio, gpio)

/* pa5a_eic_extint5 */
#define PA5A_EIC_EXTINT5 MCHP_PINMUX(a, 5, a, periph)

/* pa5a_rstc_extwake5 */
#define PA5A_RSTC_EXTWAKE5 MCHP_PINMUX(a, 5, a, periph)

/* pa5b_ac_ain1 */
#define PA5B_AC_AIN1 MCHP_PINMUX(a, 5, b, periph)

/* pa5b_adc0_ain5 */
#define PA5B_ADC0_AIN5 MCHP_PINMUX(a, 5, b, periph)

/* pa5b_ptc_y3 */
#define PA5B_PTC_Y3 MCHP_PINMUX(a, 5, b, periph)

/* pa5d_sercom0_pad1 */
#define PA5D_SERCOM0_PAD1 MCHP_PINMUX(a, 5, d, periph)

/* pa5e_tcc0_wo1 */
#define PA5E_TCC0_WO1 MCHP_PINMUX(a, 5, e, periph)

/* pa5f_tc5_wo1 */
#define PA5F_TC5_WO1 MCHP_PINMUX(a, 5, f, periph)

/* pa5i_ccl_in1 */
#define PA5I_CCL_IN1 MCHP_PINMUX(a, 5, i, periph)

/* pa5k_ptc_ds3 */
#define PA5K_PTC_DS3 MCHP_PINMUX(a, 5, k, periph)

/* pa6_gpio */
#define PA6_GPIO MCHP_PINMUX(a, 6, gpio, gpio)

/* pa6a_eic_extint6 */
#define PA6A_EIC_EXTINT6 MCHP_PINMUX(a, 6, a, periph)

/* pa6a_rstc_extwake6 */
#define PA6A_RSTC_EXTWAKE6 MCHP_PINMUX(a, 6, a, periph)

/* pa6b_ac_ain2 */
#define PA6B_AC_AIN2 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_adc0_ain6 */
#define PA6B_ADC0_AIN6 MCHP_PINMUX(a, 6, b, periph)

/* pa6b_ptc_y4 */
#define PA6B_PTC_Y4 MCHP_PINMUX(a, 6, b, periph)

/* pa6d_sercom0_pad2 */
#define PA6D_SERCOM0_PAD2 MCHP_PINMUX(a, 6, d, periph)

/* pa6e_tcc1_wo0 */
#define PA6E_TCC1_WO0 MCHP_PINMUX(a, 6, e, periph)

/* pa6f_tc6_wo0 */
#define PA6F_TC6_WO0 MCHP_PINMUX(a, 6, f, periph)

/* pa6i_ccl_in2 */
#define PA6I_CCL_IN2 MCHP_PINMUX(a, 6, i, periph)

/* pa6k_ptc_ds4 */
#define PA6K_PTC_DS4 MCHP_PINMUX(a, 6, k, periph)

/* pa7_gpio */
#define PA7_GPIO MCHP_PINMUX(a, 7, gpio, gpio)

/* pa7a_eic_extint7 */
#define PA7A_EIC_EXTINT7 MCHP_PINMUX(a, 7, a, periph)

/* pa7a_rstc_extwake7 */
#define PA7A_RSTC_EXTWAKE7 MCHP_PINMUX(a, 7, a, periph)

/* pa7b_ac_ain3 */
#define PA7B_AC_AIN3 MCHP_PINMUX(a, 7, b, periph)

/* pa7b_adc0_ain7 */
#define PA7B_ADC0_AIN7 MCHP_PINMUX(a, 7, b, periph)

/* pa7b_ptc_y5 */
#define PA7B_PTC_Y5 MCHP_PINMUX(a, 7, b, periph)

/* pa7d_sercom0_pad3 */
#define PA7D_SERCOM0_PAD3 MCHP_PINMUX(a, 7, d, periph)

/* pa7e_tcc1_wo1 */
#define PA7E_TCC1_WO1 MCHP_PINMUX(a, 7, e, periph)

/* pa7f_tc6_wo1 */
#define PA7F_TC6_WO1 MCHP_PINMUX(a, 7, f, periph)

/* pa7i_ccl_out0 */
#define PA7I_CCL_OUT0 MCHP_PINMUX(a, 7, i, periph)

/* pa7k_ptc_ds5 */
#define PA7K_PTC_DS5 MCHP_PINMUX(a, 7, k, periph)

/* pa8_gpio */
#define PA8_GPIO MCHP_PINMUX(a, 8, gpio, gpio)

/* pa8a_eic_nmi */
#define PA8A_EIC_NMI MCHP_PINMUX(a, 8, a, periph)

/* pa8a_rstc_extwake8 */
#define PA8A_RSTC_EXTWAKE8 MCHP_PINMUX(a, 8, a, periph)

/* pa8b_adc0_ain8 */
#define PA8B_ADC0_AIN8 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_adc1_ain10 */
#define PA8B_ADC1_AIN10 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_ptc_x0 */
#define PA8B_PTC_X0 MCHP_PINMUX(a, 8, b, periph)

/* pa8b_ptc_y16 */
#define PA8B_PTC_Y16 MCHP_PINMUX(a, 8, b, periph)

/* pa8c_sercom0_pad0 */
#define PA8C_SERCOM0_PAD0 MCHP_PINMUX(a, 8, c, periph)

/* pa8d_sercom2_pad0 */
#define PA8D_SERCOM2_PAD0 MCHP_PINMUX(a, 8, d, periph)

/* pa8e_tcc0_wo0 */
#define PA8E_TCC0_WO0 MCHP_PINMUX(a, 8, e, periph)

/* pa8f_tcc1_wo2 */
#define PA8F_TCC1_WO2 MCHP_PINMUX(a, 8, f, periph)

/* pa8i_ccl_in3 */
#define PA8I_CCL_IN3 MCHP_PINMUX(a, 8, i, periph)

